Catalogs/фин_ПлановаяНоменклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>фин_ПлановаяНоменклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПлановаяЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_ЕдиницыИзмеренияНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ) Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПозицииВПланеЗакупок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.узп_ТипыПозицийПлановойНоменклатурыВПланеЗакупок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакВнеоборотногоАктива</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ) Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_ЕдиницыИзмеренияНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/узп_СоответствиеВнеоборотныхАктивовПлановойНоменклатуре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>узп_СоответствиеВнеоборотныхАктивовПлановойНоменклатуре</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ПлановаяНоменклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХарактеристикаПлановойНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узп_ПлановыеХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВнеоборотныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/узп_СоответствиеПлановойИРегламентированнойНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>узп_СоответствиеПлановойИРегламентированнойНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ПлановаяНоменклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХарактеристикаПлановойНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узп_ПлановыеХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РегламентированнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/узп_ТипыПозицийПлановойНоменклатурыВПланеЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>узп_ТипыПозицийПлановойНоменклатурыВПланеЗакупок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновноеСредство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НематериальныйАктив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/фин_РежимыИнтеграцииСУчетнойСистемой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_РежимыИнтеграцииСУчетнойСистемой</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БухгалтерияДляКазахстана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Самостоятельный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомплексноеУправлениеФинансамиИБюджетированиеДляКазахстана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БухгалтерияДляКазахстана_3_0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеТорговлейДляКазахстана_3</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНДСПриИмпорте</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ) Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ) Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаАкциза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиАкциза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКПВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентРасчетаОблагаемойБазыАкциза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПодакцизногоТМЗ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодакцизныхТМЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТовараЭСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>34</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зерно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Доходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолноеКЗ</Name>
					<Comment>(Общ) Полное наименование на каз.языке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКультуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ур_ВидыКультур</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ур_КлассностьКультур</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодУрожая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ур_ГодаУрожая</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидГСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураГосЗакупок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКультур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ур_ГруппаКультур</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеНаКазахскомЯзыке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Работа</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураГЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦС_НоменклатураГосЗакупок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/фин_ПлановаяНоменклатура/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьФлагФормироватьНаименованиеПолноеАвтоматически();
	Если СокрЛП(Объект.НаименованиеПолное)<>"" Тогда
		СписокВыбораНаименований.Добавить(Объект.НаименованиеПолное);
	КонецЕсли;
	мТипПозиции = Объект.ТипПозицииВПланеЗакупок;
	Если Объект.Ссылка.Пустая() И Объект.ТипПозицииВПланеЗакупок.Пустая() Тогда
		 Объект.ТипПозицииВПланеЗакупок = Перечисления.узп_ТипыПозицийПлановойНоменклатурыВПланеЗакупок.Товар;
	КонецЕсли;
	УстановитьВидимость();
    Если Метаданные.РегистрыСведений.Найти("узп_СоответствиеВнеоборотныхАктивовПлановойНоменклатуре")<>Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СоответствиеВнеоборотныхАктивовПлановойНоменклатуре.ВнеоборотныйАктив КАК ОСНМА,
			|	СоответствиеВнеоборотныхАктивовПлановойНоменклатуре.ХарактеристикаПлановойНоменклатуры КАК Характеристика
			|ИЗ
			|	РегистрСведений.узп_СоответствиеВнеоборотныхАктивовПлановойНоменклатуре КАК СоответствиеВнеоборотныхАктивовПлановойНоменклатуре
			|ГДЕ
			|	СоответствиеВнеоборотныхАктивовПлановойНоменклатуре.ПлановаяНоменклатура = &ПлановаяНоменклатура";

		Запрос.УстановитьПараметр("ПлановаяНоменклатура", Объект.Ссылка);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	        НС = СоответствиеОС.Добавить();
			ЗаполнитьЗначенияСвойств(НС,ВыборкаДетальныеЗаписи);
		КонецЦикла;
	КонецЕсли;
	
    Если Метаданные.РегистрыСведений.Найти("узп_СоответствиеПлановойИРегламентированнойНоменклатуры")<>Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СоответствиеНоменклатуры.РегламентированнаяНоменклатура,
			|	СоответствиеНоменклатуры.ХарактеристикаПлановойНоменклатуры КАК Характеристика
			|ИЗ
			|	РегистрСведений.узп_СоответствиеПлановойИРегламентированнойНоменклатуры.СрезПоследних КАК СоответствиеНоменклатуры
			|ГДЕ
			|	СоответствиеНоменклатуры.ПлановаяНоменклатура = &ПлановаяНоменклатура";

		Запрос.УстановитьПараметр("ПлановаяНоменклатура", Объект.Ссылка);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	        НС = СоответствиеРегламентированнойНоменклатуре.Добавить();
			ЗаполнитьЗначенияСвойств(НС,ВыборкаДетальныеЗаписи);
		КонецЦикла;
	КонецЕсли;
    НадписьДополнительно = "Дополнительно";
	НадписьОсновное = "Основное";
	НадписьСоответствиеФактическимДанным = "Соответствие фактическим данным";
	Элементы.СоответствиеРегламентированнойНоменклатуреХарактеристика.Видимость = НЕ Метаданные.РегистрыСведений.узп_СоответствиеПлановойИРегламентированнойНоменклатуры.Ресурсы.ХарактеристикаПлановойНоменклатуры.Тип.СодержитТип(Тип("Строка"));
	Элементы.ОсновнойПоставщик.Видимость = Метаданные.Документы.Найти("узп_ПланЗакупок")<>Неопределено;
	Элементы.НоменклатурнаяГруппа.Видимость = НЕ фин_ОбщегоНазначенияВызовСервераПовтИсп.РежимИнтеграции()=Перечисления.фин_РежимыИнтеграцииСУчетнойСистемой.УправлениеТорговлейДляКазахстана_3;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	Элементы.СоответствиеОС.Видимость= (Метаданные.РегистрыСведений.Найти("узп_СоответствиеВнеоборотныхАктивовПлановойНоменклатуре")<>Неопределено) И (Объект.ТипПозицииВПланеЗакупок=Перечисления.узп_ТипыПозицийПлановойНоменклатурыВПланеЗакупок.НематериальныйАктив 
										ИЛИ Объект.ТипПозицииВПланеЗакупок=Перечисления.узп_ТипыПозицийПлановойНоменклатурыВПланеЗакупок.ОсновноеСредство);
	Элементы.СоответствиеРегламентированнойНоменклатуре.Видимость=(Метаданные.РегистрыСведений.Найти("узп_СоответствиеПлановойИРегламентированнойНоменклатуры")<>Неопределено) И (Объект.ТипПозицииВПланеЗакупок=Перечисления.узп_ТипыПозицийПлановойНоменклатурыВПланеЗакупок.Услуга 
										ИЛИ Объект.ТипПозицииВПланеЗакупок=Перечисления.узп_ТипыПозицийПлановойНоменклатурыВПланеЗакупок.Товар);
	Элементы.НадписьСоответствиеФактическимДанным.Видимость = Элементы.СоответствиеОС.Видимость ИЛИ Элементы.СоответствиеРегламентированнойНоменклатуре.Видимость;
КонецПроцедуры

// Процедура проверяет, совпадало ли ранее полное наименование с наименованием,
// и присваивает соответствующее значение переменной мФормироватьНаименованиеПолноеАвтоматически.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьФлагФормироватьНаименованиеПолноеАвтоматически()

	Если ПустаяСтрока(Объект.НаименованиеПолное) 
	 ИЛИ Объект.НаименованиеПолное = Объект.Наименование Тогда
		мФормироватьНаименованиеПолноеАвтоматически = Истина;

	Иначе
		мФормироватьНаименованиеПолноеАвтоматически = Ложь;

	КонецЕсли;

КонецПроцедуры // УстановитьФлагФормироватьНаименованиеПолноеАвтоматически()

// Процедура проверяет, необходимо ли формировать полное наименование автоматически или нет,
// и, если необходимо, формирует его.
//
// Параметры:
//  Нет.
//
&НаКлиенте
Процедура СформироватьНаименованиеПолноеАвтоматически()

	Если мФормироватьНаименованиеПолноеАвтоматически Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;

КонецПроцедуры // СформироватьНаименованиеПолноеАвтоматически()


&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если СокрЛП(Объект.НаименованиеПолное)<>"" И СписокВыбораНаименований.НайтиПоЗначению(Объект.НаименованиеПолное)=Неопределено Тогда
		СписокВыбораНаименований.Добавить(Объект.НаименованиеПолное);
	КонецЕсли;
	СформироватьНаименованиеПолноеАвтоматически();
КонецПроцедуры


&НаКлиенте
Процедура НаименованиеПолноеПриИзменении(Элемент)
	УстановитьФлагФормироватьНаименованиеПолноеАвтоматически();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПолноеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = СписокВыбораНаименований;
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеОСОСНМАНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.ТипПозицииВПланеЗакупок=ПредопределенноеЗначение("Перечисление.узп_ТипыПозицийПлановойНоменклатурыВПланеЗакупок.НематериальныйАктив") Тогда
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.НематериальныеАктивы");
	Иначе
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеРегламентированнойНоменклатуреНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",Новый Структура("Отбор",Новый Структура("Услуга",Объект.ТипПозицииВПланеЗакупок=ПредопределенноеЗначение("Перечисление.узп_ТипыПозицийПлановойНоменклатурыВПланеЗакупок.Услуга"))),Элемент,УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ТипПозицииВПланеЗакупокПриИзменении(Элемент)
	Если мТипПозиции <> Объект.ТипПозицииВПланеЗакупок Тогда
		СоответствиеОС.Очистить();
		СоответствиеРегламентированнойНоменклатуре.Очистить();
		мТипПозиции = Объект.ТипПозицииВПланеЗакупок;
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура История(Команда)
	ОткрытьФорму("РегистрСведений.узп_СоответствиеПлановойИРегламентированнойНоменклатуры.Форма.ФормаИстории",Новый Структура("ПлановаяНоменклатура",Объект.Ссылка),ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Метаданные.РегистрыСведений.Найти("узп_СоответствиеВнеоборотныхАктивовПлановойНоменклатуре")=Неопределено Тогда
		Возврат;
	КонецЕсли;
	НачатьТранзакцию();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоответствиеВнеоборотныхАктивовПлановойНоменклатуре.ВнеоборотныйАктив
		|ИЗ
		|	РегистрСведений.узп_СоответствиеВнеоборотныхАктивовПлановойНоменклатуре КАК СоответствиеВнеоборотныхАктивовПлановойНоменклатуре
		|ГДЕ
		|	СоответствиеВнеоборотныхАктивовПлановойНоменклатуре.ПлановаяНоменклатура = &ПлановаяНоменклатура";

	Запрос.УстановитьПараметр("ПлановаяНоменклатура", Объект.Ссылка);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.узп_СоответствиеВнеоборотныхАктивовПлановойНоменклатуре.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВнеоборотныйАктив.Установить(ВыборкаДетальныеЗаписи.ВнеоборотныйАктив);
		НаборЗаписей.Очистить();
		Попытка
			НаборЗаписей.Записать();
		Исключение
			Сообщить("Возникла ошибка при записи соответствий внеобортным активам!");
			Отказ = Истина;
			ОтменитьТранзакцию();
			Возврат;
		КонецПопытки;
	КонецЦикла;

	Для Каждого СтрокаСоответствия Из СоответствиеОС Цикл
		НаборЗаписей = РегистрыСведений.узп_СоответствиеВнеоборотныхАктивовПлановойНоменклатуре.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВнеоборотныйАктив.Установить(СтрокаСоответствия.ОСНМА);
		НаборЗаписей.Очистить();
		НЗ = НаборЗаписей.Добавить();
		НЗ.ВнеоборотныйАктив =СтрокаСоответствия.ОСНМА;
		НЗ.ПлановаяНоменклатура = Объект.Ссылка;
		НЗ.ХарактеристикаПлановойНоменклатуры = СтрокаСоответствия.Характеристика;
		Попытка
			НаборЗаписей.Записать();
		Исключение
			Сообщить("Возникла ошибка при записи соответствий внеобортным активам!");
			Отказ = Истина;
			ОтменитьТранзакцию();
			Возврат;
		КонецПопытки;
	КонецЦикла;

	ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьСоответствия();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСоответствия()
	СоответствиеРегламентированнойНоменклатуре.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеНоменклатуры.РегламентированнаяНоменклатура,
	|	СоответствиеНоменклатуры.ХарактеристикаПлановойНоменклатуры КАК Характеристика
	|ИЗ
	|	РегистрСведений.узп_СоответствиеПлановойИРегламентированнойНоменклатуры.СрезПоследних КАК СоответствиеНоменклатуры
	|ГДЕ
	|	СоответствиеНоменклатуры.ПлановаяНоменклатура = &ПлановаяНоменклатура";
	
	Запрос.УстановитьПараметр("ПлановаяНоменклатура", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НС = СоответствиеРегламентированнойНоменклатуре.Добавить();
		ЗаполнитьЗначенияСвойств(НС,ВыборкаДетальныеЗаписи);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПлановаяЕдиницаИзмеренияПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.БазоваяЕдиницаИзмерения) Тогда
		Объект.БазоваяЕдиницаИзмерения = Объект.ПлановаяЕдиницаИзмерения;
	КонецЕсли;
КонецПроцедуры
